{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 165, 780], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 183, 719], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "gru_1", "class_name": "GRU", "config": {"name": "gru_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.25, "recurrent_dropout": 0.25, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "gru_2", "class_name": "GRU", "config": {"name": "gru_2", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.25, "recurrent_dropout": 0.25, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["input_2", 0, 0, {}], ["gru_1", 0, 1, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBdABqAnwAiACDAogBiACDA1MAKQFOKQPaAUva\nD3JlcGVhdF9lbGVtZW50c9oLZXhwYW5kX2RpbXMpAdoBeCkC2gRheGlz2gNyZXCpAPoePGlweXRo\nb24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPlwAAABzAAAAAA==\n", null, [2, 165]], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcywAAAB0AHwAZAEZAGYBfABkAogAhQIZABcAiAFmARcAfACI\nAGQAhQIZABcAgwFTACkDTukAAAAA6QEAAAApAdoFdHVwbGUpAdoBeCkC2gRheGlz2gNyZXCpAPoe\nPGlweXRob24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPl0AAABzAAAAAA==\n", null, [2, 165]], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["gru_2", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBdABqAnwAiACDAogBiACDA1MAKQFOKQPaAUva\nD3JlcGVhdF9lbGVtZW50c9oLZXhwYW5kX2RpbXMpAdoBeCkC2gRheGlz2gNyZXCpAPoePGlweXRo\nb24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPlwAAABzAAAAAA==\n", null, [1, 183]], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcywAAAB0AHwAZAEZAGYBfABkAogAhQIZABcAiAFmARcAfACI\nAGQAhQIZABcAgwFTACkDTukAAAAA6QEAAAApAdoFdHVwbGUpAdoBeCkC2gRheGlz2gNyZXCpAPoe\nPGlweXRob24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPl0AAABzAAAAAA==\n", null, [1, 183]], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["lambda_2", 0, 0, {}]]]}, {"name": "time_distributed_1", "class_name": "TimeDistributed", "config": {"name": "time_distributed_1", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "time_distributed_2", "class_name": "TimeDistributed", "config": {"name": "time_distributed_2", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "dtype": "float32", "target_shape": [183, 165]}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"name": "softmax_1", "class_name": "Softmax", "config": {"name": "softmax_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "permute_1", "class_name": "Permute", "config": {"name": "permute_1", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBdABqAnwAiACDAogBiACDA1MAKQFOKQPaAUva\nD3JlcGVhdF9lbGVtZW50c9oLZXhwYW5kX2RpbXMpAdoBeCkC2gRheGlz2gNyZXCpAPoePGlweXRo\nb24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPlwAAABzAAAAAA==\n", null, [2, 256]], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcywAAAB0AHwAZAEZAGYBfABkAogAhQIZABcAiAFmARcAfACI\nAGQAhQIZABcAgwFTACkDTukAAAAA6QEAAAApAdoFdHVwbGUpAdoBeCkC2gRheGlz2gNyZXCpAPoe\nPGlweXRob24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPl0AAABzAAAAAA==\n", null, [2, 256]], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["softmax_1", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxYAAAB0AGoBdABqAnwAiACDAogBiACDA1MAKQFOKQPaAUva\nD3JlcGVhdF9lbGVtZW50c9oLZXhwYW5kX2RpbXMpAdoBeCkC2gRheGlz2gNyZXCpAPoePGlweXRo\nb24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPlwAAABzAAAAAA==\n", null, [1, 183]], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAUAAAATAAAAcywAAAB0AHwAZAEZAGYBfABkAogAhQIZABcAiAFmARcAfACI\nAGQAhQIZABcAgwFTACkDTukAAAAA6QEAAAApAdoFdHVwbGUpAdoBeCkC2gRheGlz2gNyZXCpAPoe\nPGlweXRob24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFtYmRhPl0AAABzAAAAAA==\n", null, [1, 183]], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["permute_1", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["lambda_4", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"name": "lambda_5", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcw4AAAB0AGoBfABkA2QCjQJTACkETukBAAAAKQHaBGF4aXPp\n/////ykC2gFL2gNzdW0pAdoBeKkAcgcAAAD6HjxpcHl0aG9uLWlucHV0LTMtZjFlZDA4ZDg4ZWUw\nPtoIPGxhbWJkYT6oAAAAcwAAAAA=\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxAAAAB0AHwAZABkAoUCGQCDAVMAKQNO6QEAAADp/////ykB\n2gV0dXBsZSkB2gF4qQByBQAAAPoePGlweXRob24taW5wdXQtMy1mMWVkMDhkODhlZTA+2gg8bGFt\nYmRhPqkAAABzAAAAAA==\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_5", 0, 0, {}], ["gru_2", 0, 0, {}]]]}, {"name": "time_distributed_3", "class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 256, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 719, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}